In [1]:
pip install pyspark

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pyspark in c:\users\santosh\appdata\roaming\python\python311\site-packages (3.5.1)
Requirement already satisfied: py4j==0.10.9.7 in c:\users\santosh\appdata\roaming\python\python311\site-packages (from pyspark) (0.10.9.7)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.1.1 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [1]:
from pyspark.sql import SparkSession 
spark = SparkSession.builder.appName("ETL").getOrCreate()

In [2]:
departments_df = spark.read.csv("D://Dataengineer//archive//departments.csv" , header = True , inferSchema = True) 
dept_emp_df = spark.read.csv("D://Dataengineer//archive//dept_emp.csv" , header = True , inferSchema = True)
dept_manager_df = spark.read.csv("D://Dataengineer//archive//dept_manager.csv" , header = True , inferSchema = True)
employees_df = spark.read.csv("D://Dataengineer//archive//employees.csv" , header = True , inferSchema = True)
salaries_df = spark.read.csv("D://Dataengineer//archive//salaries.csv" , header = True , inferSchema = True)

departments_df.show()
print("------------------------------------------------------------------------------------")
dept_emp_df.show()
print("------------------------------------------------------------------------------------")
dept_manager_df.show()
print("------------------------------------------------------------------------------------")
employees_df.show()
print("------------------------------------------------------------------------------------")
salaries_df.show()

+-------+------------------+
|dept_no|         dept_name|
+-------+------------------+
|   d009|  Customer Service|
|   d005|       Development|
|   d002|           Finance|
|   d003|   Human Resources|
|   d001|         Marketing|
|   d004|        Production|
|   d006|Quality Management|
|   d008|          Research|
|   d007|             Sales|
+-------+------------------+

------------------------------------------------------------------------------------
+------+-------+----------+----------+
|emp_no|dept_no| from_date|   to_date|
+------+-------+----------+----------+
| 10001|   d005|1986-06-26|9999-01-01|
| 10002|   d007|1996-08-03|9999-01-01|
| 10003|   d004|1995-12-03|9999-01-01|
| 10004|   d004|1986-12-01|9999-01-01|
| 10005|   d003|1989-09-12|9999-01-01|
| 10006|   d005|1990-08-05|9999-01-01|
| 10007|   d008|1989-02-10|9999-01-01|
| 10008|   d005|1998-03-11|2000-07-31|
| 10009|   d006|1985-02-18|9999-01-01|
| 10010|   d004|1996-11-24|2000-06-26|
| 10010|   d006|2000-06-26|9999-01-01|
| 10011|   d009|1990-01-22|1996-11-09|
| 10012|   d005|1992-12-18|9999-01-01|
| 10013|   d003|1985-10-20|9999-01-01|
| 10014|   d005|1993-12-29|9999-01-01|
| 10015|   d008|1992-09-19|1993-08-22|
| 10016|   d007|1998-02-11|9999-01-01|
| 10017|   d001|1993-08-03|9999-01-01|
| 10018|   d004|1992-07-29|9999-01-01|
| 10018|   d005|1987-04-03|1992-07-29|
+------+-------+----------+----------+
only showing top 20 rows

------------------------------------------------------------------------------------
+------+-------+----------+----------+
|emp_no|dept_no| from_date|   to_date|
+------+-------+----------+----------+
|110022|   d001|1985-01-01|1991-10-01|
|110039|   d001|1991-10-01|9999-01-01|
|110085|   d002|1985-01-01|1989-12-17|
|110114|   d002|1989-12-17|9999-01-01|
|110183|   d003|1985-01-01|1992-03-21|
|110228|   d003|1992-03-21|9999-01-01|
|110303|   d004|1985-01-01|1988-09-09|
|110344|   d004|1988-09-09|1992-08-02|
|110386|   d004|1992-08-02|1996-08-30|
|110420|   d004|1996-08-30|9999-01-01|
|110511|   d005|1985-01-01|1992-04-25|
|110567|   d005|1992-04-25|9999-01-01|
|110725|   d006|1985-01-01|1989-05-06|
|110765|   d006|1989-05-06|1991-09-12|
|110800|   d006|1991-09-12|1994-06-28|
|110854|   d006|1994-06-28|9999-01-01|
|111035|   d007|1985-01-01|1991-03-07|
|111133|   d007|1991-03-07|9999-01-01|
|111400|   d008|1985-01-01|1991-04-08|
|111534|   d008|1991-04-08|9999-01-01|
+------+-------+----------+----------+
only showing top 20 rows

------------------------------------------------------------------------------------
+------+----------+----------+-----------+------+----------+
|emp_no|birth_date|first_name|  last_name|gender| hire_date|
+------+----------+----------+-----------+------+----------+
| 10001|1953-09-02|    Georgi|    Facello|     M|1986-06-26|
| 10002|1964-06-02|   Bezalel|     Simmel|     F|1985-11-21|
| 10003|1959-12-03|     Parto|    Bamford|     M|1986-08-28|
| 10004|1954-05-01| Chirstian|    Koblick|     M|1986-12-01|
| 10005|1955-01-21|   Kyoichi|   Maliniak|     M|1989-09-12|
| 10006|1953-04-20|    Anneke|    Preusig|     F|1989-06-02|
| 10007|1957-05-23|   Tzvetan|  Zielinski|     F|1989-02-10|
| 10008|1958-02-19|    Saniya|   Kalloufi|     M|1994-09-15|
| 10009|1952-04-19|    Sumant|       Peac|     F|1985-02-18|
| 10010|1963-06-01| Duangkaew|   Piveteau|     F|1989-08-24|
| 10011|1953-11-07|      Mary|      Sluis|     F|1990-01-22|
| 10012|1960-10-04|  Patricio|  Bridgland|     M|1992-12-18|
| 10013|1963-06-07| Eberhardt|     Terkki|     M|1985-10-20|
| 10014|1956-02-12|     Berni|      Genin|     M|1987-03-11|
| 10015|1959-08-19|  Guoxiang|  Nooteboom|     M|1987-07-02|
| 10016|1961-05-02|  Kazuhito|Cappelletti|     M|1995-01-27|
| 10017|1958-07-06| Cristinel|  Bouloucos|     F|1993-08-03|
| 10018|1954-06-19|  Kazuhide|       Peha|     F|1987-04-03|
| 10019|1953-01-23|   Lillian|    Haddadi|     M|1999-04-30|
| 10020|1952-12-24|    Mayuko|    Warwick|     M|1991-01-26|
+------+----------+----------+-----------+------+----------+
only showing top 20 rows

------------------------------------------------------------------------------------
+------+------+----------+----------+
|emp_no|salary| from_date|   to_date|
+------+------+----------+----------+
| 10001| 60117|1986-06-26|1987-06-26|
| 10001| 62102|1987-06-26|1988-06-25|
| 10001| 66074|1988-06-25|1989-06-25|
| 10001| 66596|1989-06-25|1990-06-25|
| 10001| 66961|1990-06-25|1991-06-25|
| 10001| 71046|1991-06-25|1992-06-24|
| 10001| 74333|1992-06-24|1993-06-24|
| 10001| 75286|1993-06-24|1994-06-24|
| 10001| 75994|1994-06-24|1995-06-24|
| 10001| 76884|1995-06-24|1996-06-23|
| 10001| 80013|1996-06-23|1997-06-23|
| 10001| 81025|1997-06-23|1998-06-23|
| 10001| 81097|1998-06-23|1999-06-23|
| 10001| 84917|1999-06-23|2000-06-22|
| 10001| 85112|2000-06-22|2001-06-22|
| 10001| 85097|2001-06-22|2002-06-22|
| 10001| 88958|2002-06-22|9999-01-01|
| 10002| 65828|1996-08-03|1997-08-03|
| 10002| 65909|1997-08-03|1998-08-03|
| 10002| 67534|1998-08-03|1999-08-03|
+------+------+----------+----------+
only showing top 20 rows

### Concanting first_name and last_name to full _name column and Dropping Columns First_name and last_name

In [3]:
from pyspark.sql.functions import lit , concat
employees_df = employees_df.withColumn("full_name" , concat(employees_df.first_name , lit(" ") , employees_df.last_name))
drop_columns = ["first_name" , "last_name"]
employees_df = employees_df.drop(*drop_columns)
employees_df.show()

+------+----------+------+----------+--------------------+
|emp_no|birth_date|gender| hire_date|           full_name|
+------+----------+------+----------+--------------------+
| 10001|1953-09-02|     M|1986-06-26|      Georgi Facello|
| 10002|1964-06-02|     F|1985-11-21|      Bezalel Simmel|
| 10003|1959-12-03|     M|1986-08-28|       Parto Bamford|
| 10004|1954-05-01|     M|1986-12-01|   Chirstian Koblick|
| 10005|1955-01-21|     M|1989-09-12|    Kyoichi Maliniak|
| 10006|1953-04-20|     F|1989-06-02|      Anneke Preusig|
| 10007|1957-05-23|     F|1989-02-10|   Tzvetan Zielinski|
| 10008|1958-02-19|     M|1994-09-15|     Saniya Kalloufi|
| 10009|1952-04-19|     F|1985-02-18|         Sumant Peac|
| 10010|1963-06-01|     F|1989-08-24|  Duangkaew Piveteau|
| 10011|1953-11-07|     F|1990-01-22|          Mary Sluis|
| 10012|1960-10-04|     M|1992-12-18|  Patricio Bridgland|
| 10013|1963-06-07|     M|1985-10-20|    Eberhardt Terkki|
| 10014|1956-02-12|     M|1987-03-11|         Berni Genin|
| 10015|1959-08-19|     M|1987-07-02|  Guoxiang Nooteboom|
| 10016|1961-05-02|     M|1995-01-27|Kazuhito Cappelletti|
| 10017|1958-07-06|     F|1993-08-03| Cristinel Bouloucos|
| 10018|1954-06-19|     F|1987-04-03|       Kazuhide Peha|
| 10019|1953-01-23|     M|1999-04-30|     Lillian Haddadi|
| 10020|1952-12-24|     M|1991-01-26|      Mayuko Warwick|
+------+----------+------+----------+--------------------+
only showing top 20 rows

In [4]:
departments_df.printSchema()
employees_df.printSchema()
dept_emp_df.printSchema()
dept_manager_df.printSchema()
salaries_df.printSchema()

root
 |-- dept_no: string (nullable = true)
 |-- dept_name: string (nullable = true)

root
 |-- emp_no: integer (nullable = true)
 |-- birth_date: date (nullable = true)
 |-- gender: string (nullable = true)
 |-- hire_date: date (nullable = true)
 |-- full_name: string (nullable = true)

root
 |-- emp_no: integer (nullable = true)
 |-- dept_no: string (nullable = true)
 |-- from_date: date (nullable = true)
 |-- to_date: date (nullable = true)

root
 |-- emp_no: integer (nullable = true)
 |-- dept_no: string (nullable = true)
 |-- from_date: date (nullable = true)
 |-- to_date: date (nullable = true)

root
 |-- emp_no: integer (nullable = true)
 |-- salary: integer (nullable = true)
 |-- from_date: date (nullable = true)
 |-- to_date: date (nullable = true)

In [5]:
duplicate_rows_count = dept_emp_df.count() - dept_emp_df.distinct().count()
print(duplicate_rows_count)

print(dept_manager_df.count() - dept_manager_df.distinct().count())
print(employees_df.count() - employees_df.distinct().count())

0
0
0

## Finding Duplicates in Salary Table
##### Are there multiple salary records for the same employee and time period in the salaries table?

In [6]:
from pyspark.sql.functions import col , max , min , when , lag , lead 
from pyspark.sql import Window
window = Window.partitionBy("emp_no").orderBy("from_date")
salaries_df = salaries_df.withColumn("prev_to_date" , lag("to_date" , 1).over(window)) \
            .withColumn("next_from_date" , lead("from_date" , 1).over(window)).withColumn("prev_salary", lag("salary", 1).over(window))

duplicates = salaries_df.filter(
    (col('from_date') <= col("next_from_date")) &
    (col("prev_to_date") <= col("to_date")) &
    (col("salary") != col("prev_salary"))
)
print(salaries_df.count())
print(duplicates.count())

2844047
2251965

In [7]:
#Creating Function to check Nulls 
def get_null_count(cl , df):
    from pyspark.sql.functions import col
    null_counts = df.filter(col(cl).isNull()).count()
    return null_counts

### Checking nulls in Salary DF

In [8]:
print(get_null_count(cl = "emp_no" , df= salaries_df))
print(get_null_count(cl = "from_date" , df= salaries_df))
print(get_null_count(cl = "to_date" , df= salaries_df))

0
0
0

### Checking nulls in dept_emp , dept_manager

In [9]:
print(get_null_count(cl = "dept_no" , df= dept_emp_df))
print(get_null_count(cl = "dept_no" , df= dept_manager_df))

0
0

## Transformation

#### Calculate the Employee tenure

In [29]:
from pyspark.sql.functions import current_date , months_between , datediff , round
employees_df = employees_df.withColumn("tenure" , round(months_between(current_date() , col('hire_date'))/12 , 2))
employees_df.show()

+------+----------+------+----------+--------------------+------+
|emp_no|birth_date|gender| hire_date|           full_name|tenure|
+------+----------+------+----------+--------------------+------+
| 10001|1953-09-02|     M|1986-06-26|      Georgi Facello| 38.19|
| 10002|1964-06-02|     F|1985-11-21|      Bezalel Simmel| 38.78|
| 10003|1959-12-03|     M|1986-08-28|       Parto Bamford| 38.02|
| 10004|1954-05-01|     M|1986-12-01|   Chirstian Koblick| 37.76|
| 10005|1955-01-21|     M|1989-09-12|    Kyoichi Maliniak| 34.98|
| 10006|1953-04-20|     F|1989-06-02|      Anneke Preusig| 35.25|
| 10007|1957-05-23|     F|1989-02-10|   Tzvetan Zielinski| 35.56|
| 10008|1958-02-19|     M|1994-09-15|     Saniya Kalloufi| 29.97|
| 10009|1952-04-19|     F|1985-02-18|         Sumant Peac| 39.54|
| 10010|1963-06-01|     F|1989-08-24|  Duangkaew Piveteau| 35.03|
| 10011|1953-11-07|     F|1990-01-22|          Mary Sluis| 34.62|
| 10012|1960-10-04|     M|1992-12-18|  Patricio Bridgland| 31.71|
| 10013|1963-06-07|     M|1985-10-20|    Eberhardt Terkki| 38.87|
| 10014|1956-02-12|     M|1987-03-11|         Berni Genin| 37.48|
| 10015|1959-08-19|     M|1987-07-02|  Guoxiang Nooteboom| 37.17|
| 10016|1961-05-02|     M|1995-01-27|Kazuhito Cappelletti|  29.6|
| 10017|1958-07-06|     F|1993-08-03| Cristinel Bouloucos| 31.08|
| 10018|1954-06-19|     F|1987-04-03|       Kazuhide Peha| 37.42|
| 10019|1953-01-23|     M|1999-04-30|     Lillian Haddadi| 25.34|
| 10020|1952-12-24|     M|1991-01-26|      Mayuko Warwick|  33.6|
+------+----------+------+----------+--------------------+------+
only showing top 20 rows

### Calculate longest server employee

In [66]:
from pyspark.sql.functions import max
employees_df.sort(employees_df.tenure.desc()).select('full_name' , 'tenure').head(1)

[Row(full_name='Margareta Markovitch', tenure=39.67)]

In [61]:
help(max)

Help on function max in module pyspark.sql.functions:

max(col: 'ColumnOrName') -> pyspark.sql.column.Column
    Aggregate function: returns the maximum value of the expression in a group.

    .. versionadded:: 1.3.0

    .. versionchanged:: 3.4.0
        Supports Spark Connect.

    Parameters
    ----------
    col : :class:`~pyspark.sql.Column` or str
        target column to compute on.

    Returns
    -------
    :class:`~pyspark.sql.Column`
        column for computed results.

    Examples
    --------
    >>> df = spark.range(10)
    >>> df.select(max(col("id"))).show()
    +-------+
    |max(id)|
    +-------+
    |      9|
    +-------+

## Calculate increase Salary Percentage

In [36]:
from pyspark.sql.functions import abs , when ,lit
win = Window.partitionBy("emp_no").orderBy("from_date")
salaries_df = salaries_df.withColumn("prev_salary" ,lag("salary" , 1).over(win))
salaries_df = salaries_df.withColumn("salary_increase" , \
                                     when(col("prev_salary").isNotNull() ,
                                          round(abs((col("prev_salary")- col("salary")) / col("prev_salary")) * 100 , 2)).otherwise(lit(0)))
salaries_df.show()

+------+------+----------+----------+------------+--------------+-----------+---------------+
|emp_no|salary| from_date|   to_date|prev_to_date|next_from_date|prev_salary|salary_increase|
+------+------+----------+----------+------------+--------------+-----------+---------------+
| 10010| 72488|1996-11-24|1997-11-24|        NULL|    1997-11-24|       NULL|            0.0|
| 10010| 74347|1997-11-24|1998-11-24|  1997-11-24|    1998-11-24|      72488|           2.56|
| 10010| 75405|1998-11-24|1999-11-24|  1998-11-24|    1999-11-24|      74347|           1.42|
| 10010| 78194|1999-11-24|2000-11-23|  1999-11-24|    2000-11-23|      75405|            3.7|
| 10010| 79580|2000-11-23|2001-11-23|  2000-11-23|    2001-11-23|      78194|           1.77|
| 10010| 80324|2001-11-23|9999-01-01|  2001-11-23|          NULL|      79580|           0.93|
| 10011| 42365|1990-01-22|1991-01-22|        NULL|    1991-01-22|       NULL|            0.0|
| 10011| 44200|1991-01-22|1992-01-22|  1991-01-22|    1992-01-22|      42365|           4.33|
| 10011| 48214|1992-01-22|1993-01-21|  1992-01-22|    1993-01-21|      44200|           9.08|
| 10011| 50927|1993-01-21|1994-01-21|  1993-01-21|    1994-01-21|      48214|           5.63|
| 10011| 51470|1994-01-21|1995-01-21|  1994-01-21|    1995-01-21|      50927|           1.07|
| 10011| 54545|1995-01-21|1996-01-21|  1995-01-21|    1996-01-21|      51470|           5.97|
| 10011| 56753|1996-01-21|1996-11-09|  1996-01-21|          NULL|      54545|           4.05|
| 10013| 40000|1985-10-20|1986-10-20|        NULL|    1986-10-20|       NULL|            0.0|
| 10013| 40623|1986-10-20|1987-10-20|  1986-10-20|    1987-10-20|      40000|           1.56|
| 10013| 40561|1987-10-20|1988-10-19|  1987-10-20|    1988-10-19|      40623|           0.15|
| 10013| 40306|1988-10-19|1989-10-19|  1988-10-19|    1989-10-19|      40561|           0.63|
| 10013| 43569|1989-10-19|1990-10-19|  1989-10-19|    1990-10-19|      40306|            8.1|
| 10013| 46305|1990-10-19|1991-10-19|  1990-10-19|    1991-10-19|      43569|           6.28|
| 10013| 47118|1991-10-19|1992-10-18|  1991-10-19|    1992-10-18|      46305|           1.76|
+------+------+----------+----------+------------+--------------+-----------+---------------+
only showing top 20 rows

### Calculate Average salary deparment wise

In [55]:
from pyspark.sql.functions import avg
Avg_salary = salaries_df.join(dept_emp_df.select("emp_no" , "dept_no") , "emp_no").join(departments_df.select("dept_no" , "dept_name") , "dept_no")
Avg_salary.groupBy('dept_name').agg(avg('salary').alias('avg_salary')).show()

+------------------+------------------+
|         dept_name|        avg_salary|
+------------------+------------------+
|             Sales| 80667.60575533769|
|Quality Management| 57251.27191341599|
|           Finance| 70489.36489699609|
|        Production|59605.482461651445|
|          Research|  59665.1817012686|
|  Customer Service| 58770.36647976248|
|         Marketing| 71913.20000419153|
|       Development| 59478.90116243182|
|   Human Resources| 55574.87936969553|
+------------------+------------------+

In [18]:
help(months_between)

Help on function months_between in module pyspark.sql.functions:

months_between(date1: 'ColumnOrName', date2: 'ColumnOrName', roundOff: bool = True) -> pyspark.sql.column.Column
    Returns number of months between dates date1 and date2.
    If date1 is later than date2, then the result is positive.
    A whole number is returned if both inputs have the same day of month or both are the last day
    of their respective months. Otherwise, the difference is calculated assuming 31 days per month.
    The result is rounded off to 8 digits unless `roundOff` is set to `False`.

    .. versionadded:: 1.5.0

    .. versionchanged:: 3.4.0
        Supports Spark Connect.

    Parameters
    ----------
    date1 : :class:`~pyspark.sql.Column` or str
        first date column.
    date2 : :class:`~pyspark.sql.Column` or str
        second date column.
    roundOff : bool, optional
        whether to round (to 8 digits) the final value or not (default: True).

    Returns
    -------
    :class:`~pyspark.sql.Column`
        number of months between two dates.

    Examples
    --------
    >>> df = spark.createDataFrame([('1997-02-28 10:30:00', '1996-10-30')], ['date1', 'date2'])
    >>> df.select(months_between(df.date1, df.date2).alias('months')).collect()
    [Row(months=3.94959677)]
    >>> df.select(months_between(df.date1, df.date2, False).alias('months')).collect()
    [Row(months=3.9495967741935485)]

##